"""
Напишите программу, которая принимает два списка и выводит все элементы первого, которых нет во втором.

‌

1 список

1 2 3 11 2 2 311 2 2 12 3 12 31213 2 123 12

2 список

12 3 1 2 12 323 12 32 7 18273 26 12 73426 12
"""
b = [12, 3, 1, 2, 12, 323, 12, 32, 7, 18273, 26, 12, 73426, 12]
a = [1, 2, 3, 11, 2, 2, 311, 2, 2, 12, 3, 12, 31213, 2, 123, 12]
for v in b:
    if v != v:
        break
for i in a:
    if i != v:
        print(i)
for v in b:
    if v != i:
        break